# C:\Users\Did-Fil\PycharmProjects\9.1 Masking bank card and account numbers

# git init     создание локального репозитория
# git status     посмотреть статус репозитория
# git add название_файла     добавить в индекс (выбор файлов для коммита)
# git commit -m 'название коммита'     файлы из индекса отправить в репозиторий
# git reset HEAD     удалить все изменения из индекса

# Remove-Item -Recurse -Force .git     удаление локального репозитория

# git branch     Показать список существующих веток в вашем репозитории
# git branch название ветки     Создать новую ветку с указанным именем, но не переключать на нее
# git branch -d название ветки     Удалить указанную ветку. Это безопасная операция, Git не позволит удалить ветку с неслитыми изменениями.
# git branch -D название ветки     Принудительно удалить ветку, даже если в ней есть неслитые изменения
# git branch -m название ветки     Переименовать текущую ветку
# git branch -a     Вывести список удаленных веток

# git checkout название ветки     Эта команда переключает на указанную ветку
# git checkout -b название ветки     Создание новой ветки и переключение на нее
#











